Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The C<import> is not a builtin; it's just an ordinary static method call into the C<Module> package to tell the module to import the list of features back into the current package.
es_es: El C<import> no es una orden interna; es sólo una llamada al método estático ordinario en el paquete C<Módulo> para indicar al módulo que importe la lista de características en el paquete actual.

source: =item shutdown SOCKET,HOW X<shutdown>
es_es: =item shutdown SOCKET,CÓMO X<shutdown>

source: The C<< => >> operator is a synonym for the comma except that it causes its left operand to be interpreted as a string if it begins with a letter or underscore and is composed only of letters, digits and underscores.
es_es: El operador C<< => >> es un sinónimo de la coma, salvo que causa que su operando izquierdo debe interpretarse como una cadena si comienza con una letra o un subrayado y está exclusivamente integrado por letras, dígitos y subrayados.

source: The file is included via the do-FILE mechanism, which is essentially just a variety of C<eval> with the caveat that lexical variables in the invoking script will be invisible to the included code.
es_es: El archivo es incluido a través del mecanismo do ARCHIVO, que es esencialmente lo mismo que una variedad de C<eval> con la advertencia de que las variables léxicas en la secuencia de comandos del programa serán invisibles para el código incluido.

source: A zero-width positive look-ahead assertion.
es_es: Una aserción consiguiente positiva de ancho cero.

source: # the Perlish post-condition way
es_es: # ahora con una condición posterior, al estilo Perl

source: It is equivalent to C<(?!)>, but easier to read.
es_es: Es equivalente a C<(?!)>, pero más fácil de leer.

source: print (...) interpreted as function at - line 1.
es_es: print (...) interpreted as function at - line 1. (print (...) interpretado como función en - línea 1)

source: There are multiple cases.
es_es: Hay múltiples casos.

source: If the hook is an array reference, its first element must be a subroutine reference.
es_es: Si el enganche es una referencia de array, su primer elemento debe ser una referencia a una subrutina.

source: =item C<< (?P>NAME) >>
es_es: =item C<< (?P>NOMBRE) >>

source: You can override that with an explicit C<last> if you're only interested in the first match.
es_es: Puede invalidar esto con un explícito C<last> si solo está interesado en la primera coincidencia.

# printf "%3$d %d %d ", 12, 34, 56; # will print "56 12 34 "
source: printf "%3\$d %d %d\n", 12, 34, 56; # will print "56 12 34\n"
es_es: printf "%3\$d %d %d\n", 12, 34, 56; # imprimirá "56 12 34\n"

source: Every variable type has its own namespace, as do several non-variable identifiers.
es_es: Cada tipo de variable tiene su propio espacio de nombres, y ocurre igual con otros tipos de identificadores que no designan variables.

source: or die "Can't open STDOUT: $!";
es_es: or die "No puedo abrir STDOUT: $!";

source: # ASCII-based examples
es_es: # Ejemplo basados en ASCII

source: B<Be aware> that calling exists on array values is deprecated and likely to be removed in a future version of Perl.
es_es: B<Queda avisado> que borrar elementos de un array mediante delete() es una funcionalidad obsoleta y es probable que sea eliminada en una futura versión de Perl.

source: What does CPAN/src/... mean?
es_es: ¿Qué significa CPAN/src/... ?

source: During this search no attention is paid to the semantics of the construct.
es_es: Durante esta búsqueda no se presta atención a la semántica de la construcción.

source: Complete rewrite.
es_es: Reescritura completa.

source: You can see whether using C<!> makes any difference this way:
es_es: Se puede ver si usando C<!> provoca alguna diferencia, de esta manera:

source: with foreword by Larry Wall
es_es: con prólogo de Larry Wall

source: shutdown(SOCKET, 0); # I/we have stopped reading data
es_es: shutdown(SOCKET, 0); # Hemos dejado de leer datas

source: my($what,$where,$howmuch) = @_;
es_es: my($que,$donde,$cuanto) = @_;

source: Note that the rule for zero-length matches (see L</"Repeated Patterns Matching a Zero-length Substring">) is modified somewhat, in that contents to the left of C<\G> are not counted when determining the length of the match.
es_es: Tenga en cuanto que la norma para las coincidencias de tamaño cero (vea L</"Patrones repetidos coincidiendo con subcadenas de longitud cero">) ha sido modificada en cierta medida, en que los contenidos a la izquierda de C<\G> no son tenidos en cuenta cuando se determina la longitud de la coincidencia.

source: # SYNTAX ERROR HERE.
es_es: # ERROR DE SINTAXIS

source: instead, it has C<\Q>, C<\\>, and C<E>, so the result is the same as for C<"\\\\E">.
es_es: en cambio, tiene a C<\Q>, C<\\>, y C<E>, por lo que el resultado es el mismo que para C<"\\\\E">.

source: In Cygwin Perl can now be built with threads (C<Configure -Duseithreads>).
es_es: En Cygwin Perl ahora se puede construir con soporte de hilos de ejecución (C<Configure -Duseithreads>).

source: Bitstrings of any size may be manipulated by the bitwise operators (C<~ | & ^>).
es_es: Cadenas de bits de cualquier tamaño pueden ser manipulados por los operadores binarios (C<~ | & ^>).

source: open(my $oldout, ">&STDOUT") or die "Can't dup STDOUT: $!";
es_es: open(my $oldout, ">&STDOUT") or die "No puedo duplicar STDOUT: $!";

source: Ah, but what if you wanted a I<two-dimensional slice>, such as having $x run from 4..8 and $y run from 7 to 12?
es_es: ¡Ah!, pero ¿qué pasa si yo quisiera un I<porción bidimensional>, ¿cómo hacer que $x vaya de 4 al 8 y $y de 7 al 12?

source: All proper perl installations have fully-accessible documentation.
es_es: Todas las instalaciones de perl ofrecen documentación totalmente accesible.

source: At other times, you might prefer to determine whether string data can be used numerically by calling the POSIX::strtod() function or by inspecting your string with a regular expression (as documented in L<perlre>).
es_es: En otras ocasiones, podría ser preferible determinar si una cadena de datos puede ser usada numéricamente llamando a la función POSIX::strtod() o inspeccionando la cadena con una expresión regular (las cuales están documentadas en L<perlre>).

source: You can't rely on the alarm causing the system call to fail with C<$!> set to C<EINTR> because Perl sets up signal handlers to restart system calls on some systems.
es_es: No puede confiar que la alarma que llama a la llamada del sistema falle y ponga C<$!> a C<EINTR> porque Perl activa gestores de señal para reiniciar llamadas al sistema en algunos sistemas.

source: The C<p> and C<P> formats should be used with care.
es_es: Los formatos C<p> y C<P> deben ser utilizados con cuidado.

source: Like all Perl character operations, length() normally deals in logical characters, not physical bytes.
es_es: Al igual que todas las operaciones Perl, de caracteres, length() normalmente trata con caracteres lógicos, no bytes físicos.

source: The regexp engine is now more robust when given invalid utf8 input, as is sometimes generated by buggy XS modules.
es_es: El motor regex es ahora más sólido cuando se le administra una entrada utf8 inválida, como a veces se genera por parte de módulos XS con errores.

source: Note that there is no comma after VERSION!
es_es: ¡Tenga en cuenta que no hay ninguna coma después de VERSIÓN!

source: by Richard Foley
es_es: Richard Foley

source: You can also use C<pos()> to know what is the current position of matching within this string.
es_es: También puede utilizar C<pos()> para saber cuál es la posición actual de coincidencia dentro de esa cadena.

source: A backslash represents a backslash unless followed by the delimiter or another backslash, in which case the delimiter or backslash is interpolated.
es_es: Una barra invertida representa una barra invertida a menos que esté seguida por el delimitador u otra barra invertida, en cuyo caso el delimitador o la barra invertida son interpolados.

source: The construct C<eval { goto &foo }> is now disallowed.
es_es: La construcción C<eval { goto &foo }> ya no está permitida.

source: It does not attempt to do titlecase mapping on initial letters.
es_es: No intentará hacer un mapeo de mayúsculas con tilder en las letras iniciales.

source: In Perl 5.8.0 the so-called "safe signals" were introduced.
es_es: En Perl 5.8.0 fue introducido el concepto llamado "acceso a señales de forma segura".

source: Operations that require perl to read a process's list of groups, such as reads of C<$(> and C<$)>, now dynamically allocate memory rather than using a fixed sized array.
es_es: Las operaciones que requiere perl para leer la lista de procesos agrupados, tales como lecturas de C<$(> y C<$)>, ahora es asignada dinámicamente la memoria en lugar de utilizar un array de tamaño fijo.

source: overload::constant 'qr' => \&convert;
es_es: overload::constant 'qr' => \&convertir;

source: Perl by default is very forgiving.
es_es: Por su diseño, Perl es un lenguaje muy indulgente.

source: A C<SCALAR> method is now available for tied hashes.
es_es: Un método C<SCALAR> está ahora disponible para los hash enlazados.

source: The L<perlglossary> manpage is a glossary of terms used in the Perl documentation, technical and otherwise, kindly provided by O'Reilly Media, inc.
es_es: La página de manual L<perlglossary> es un glosario de términos utilizados en la documentación de Perl, técnicos y otros, amablemente proporcionado por O'Reilly Media, inc.

source: @articles = sort {$a cmp $b} @files;
es_es: @articulos = sort {$a cmp $b} @archivos;

source: Back before Perl had the XS system for connecting with C libraries, programmers used to get library constants by reading through the C header files.
es_es: Mucho antes de que existiera en Perl el sistema XS para conectar bibliotecas C, los programadores tenían que leer los archivos de encabezado de C para obtener las constantes de biblioteca.

source: The following example shows a 2 level hash of hash structure using anonymous hash references.
es_es: En el ejemplo siguiente se muestra una estructura de hash de hashes de 2 niveles en la que se usan referencias de hash anónimas.

source: Some internal code cleanup.
es_es: Alguna limpieza interna de código.

source: Various socket problems were fixed in mpeix.c.
es_es: Diversos problemas con socket fueron arreglados en mpeix.c.

source: $in_header = 1 ..
es_es: $en_cabecera = 1 ..

source: 56 tests and 474 subtests skipped.
es_es: 56 tests y 474 subtests omitidos.

source: See L<perlembed>.
es_es: Vea L<perlembed>.

source: j intepret integer as C type "intmax_t" on Perl 5.14
es_es: j interpreta un entero como un "intmax_t" del C en Perl 5.14

source: C<List::Util> upgraded to version 1.18 (was 1.14)
es_es: C<List::Util> actualizado a la versión 1.18 (era 1.14)

source: Likewise, if you say
es_es: Del mismo modo, si dice

source: C<Text::Wrap> upgraded to version 2005.082401
es_es: C<Text::Wrap> actualizado a la versión 2005.082401

source: If you open a pipe on the command C<-> (that is, specify either C<|-> or C<-|> with the one- or two-argument forms of C<open>), an implicit C<fork> is done, so C<open> returns twice: in the parent process it returns the pid of the child process, and in the child process it returns (a defined) C<0>.
es_es: Si abre una tubería en el comando C<-> (es decir, ya sea C<|-> o C<-|> con la forma de uno o dos argumentos de C<open>), entonces se crea un C<fork> implícito, y C<open> regresa dos veces: en el proceso padre devuelve el PID del proceso hijo, y el proceso hijo devuelve un (definido valor) C<0>.

source: See L<perlrecharclass/Backslash sequences> for details.
es_es: Vea L<perlrecharclass/Secuencias con contrabarra> para más detalles.

source: For example, while searching for terminating C</>, combinations of C<\\> and C<\/> are skipped.
es_es: Por ejemplo, mientras se busca por el C</> final, las combinaciones de C<\\> y C<\/> son omitidas.

source: A thread exited while %d other threads were still running
es_es: I<A thread exited while %d other threads were still running> (Un hilo de ejecución terminó mientras %d otros hilos seguían ejecutándose)

source: If you want to pass switches into your script, you can use one of the Getopts modules or put a loop on the front like this:
es_es: Si desea pasar opciones en su programa, puede utilizar uno de los módulos Getopts o poner un bucle, al principio, de esta manera:

source: The only interpolation is removal of C<\> from pairs of C<\\>.
es_es: La única interpolación es la eliminación de C<\> a partir de pares de C<\\>.

source: print $ref; # prints HASH(0x80d3d5c)
es_es: print $ref; # imprime HASH(0x80d3d5c)

source: This is all very above-board and honest.
es_es: Todo esto trata sobre la honradez.

source: C<$+> returns whatever the last bracket match matched.
es_es: C<$+> devuelve cualquiera que sea el último paréntesis de captura coincidente.

source: If you turn on the C<use re 'eval'>, though, it is no longer secure, so you should only do so if you are also using taint checking.
es_es: Si activa C<use re 'eval'>, sin embargo, ya no es seguro, por lo que debería usarlo solo si está utilizando comprobaciones pringosas (I<taint>).

source: Returns the value of EXPR with the first character in uppercase (titlecase in Unicode).
es_es: Devuelve el valor de EXPR con el primer carácter en mayúsculas.

# print HANDLE "stuff $$ ";
source: print HANDLE "stuff $$\n";
es_es: print HANDLE "algo $$\n";

source: This call is actually implemented in terms of recvfrom(2) system call.
es_es: Esta llamada está implementada actualmente en términos de la llamada del sistema recvfrom(2).

source: The following efficiently counts the number of set bits in a bit vector:
es_es: A continuación, de manera eficiente, cuenta el número de bits establecidos en un vector de bits:

source: When the # flag and a precision are given in the %o conversion, the precision is incremented if it's necessary for the leading "0".
es_es: Cuando la bandera # y una precisión se dan en la conversión %o, la precisión es incrementada si es necesario para el "0" inicial.

source: Pragmata are now correctly propagated into (?{...}) constructions in regexps.
es_es: Pragmata ahora se propaga correctamente en construcciones (?{...}) en las expresiones regulares.

source: then the sort operation provides list context for <>, which will proceed to read every line available up to the end of file, and pass that list of lines back to the sort routine, which will then sort those lines and return them as a list to whatever the context of the sort was.
es_es: entonces la operación sort establece un contexto de lista para <>, el cual procede a leer todas las líneas disponibles hasta alcanzar el final del archivo, y envía de vuelta esa lista de líneas a la subrutina sort, que entonces ordena las líneas y las devuelve como una lista o lo que sea dependiendo de cuál sea el contexto en que esté sort.

source: ? Match 1 or 0 times
es_es: ? Coincide 1 o 0 veces

source: Perl is usually pretty good about this, but some pathological cases might trigger this, such as C<$a///> (is that C<($a) / (//)> or C<$a // />?) and C<print $fh //> (C<print $fh(//> or C<print($fh //>?).
es_es: Perl es, por lo general, bastante bueno sobre esto, pero algunos casos patológicos podrían dar lugar a esto, como en, C<$a///> (es C<($a) / (//)> o C<$a // />?) y C<print $fh //> (C<print $fh(//> o C<print($fh //>?).

source: For those of you that choose to use the GNU General Public License, my interpretation of the GNU General Public License is that no Perl script falls under the terms of the GPL unless you explicitly put said script under the terms of the GPL yourself.
es_es: Para aquellos de ustedes que decidan utilizar la Licencia Pública General GNU, mi interpretación de la Licencia Pública General GNU es que ningún script en Perl cae bajo los términos de la GPL a menos que usted mismo, explícitamente, ponga dicho script en los términos de la GPL.

source: C<ODBM_File> upgraded to version 1.06
es_es: C<ODBM_File> actualizado a la versión 1.06

source: our $bar = 30; # declares $Bar::bar for rest of lexical scope
es_es: our $bar = 30; # declara $Bar::bar para el resto del ámbito léxico

source: print(" digits"), redo LOOP if /\G\d+\b[,.;]?\s*/gc;
es_es: print(" dígitos"), redo LOOP if /\G\d+\b[,.;]?\s*/gc;

source: "\N{LATIN SMALL LIGATURE FI}" =~ /(f)(i)/i; # Doesn't match!
es_es: "\N{LATIN SMALL LIGATURE FI}" =~ /(f)(i)/i; # ¡No coincide!

source: Note that C<canonpath> on Unix still does B<not> collapse these sections, as doing so would be incorrect.
es_es: Tenga en cuenta que C<canonpath> en Unix sigue B<sin> colapsar estas secciones, ya que, de hacerlo, sería incorrecto.

source: Returns the prototype of a function as a string (or C<undef> if the function has no prototype).
es_es: Devuelve el prototipo de una función como una cadena (o C<undef> si la función no tiene ningún prototipo).

source: Such combinations can include alternatives, leading to a problem of choice: if we match a regular expression C<a|ab> against C<"abc">, will it match substring C<"a"> or C<"ab">?
es_es: Estas combinaciones pueden incluir alternativas, dando lugar a un problema de elección: ¿si tenemos una expresión regular C<a|ab> contra C<"abc">, coincidirá con la subcadena C<"a"> o con la C<"ab">?

source: Similarly, an C<eof()> after C<< <> >> has returned end-of-file will assume you are processing another C<@ARGV> list, and if you haven't set C<@ARGV>, will read input from C<STDIN>; see L<perlop/"I/O Operators">.
es_es: De forma semejante, un C<eof()> después de que un C<< <> >> haya devuelto un fin-de-archivo asumirá que está procesando otra lista C<@ARGV>, y si no ha puesto un nuevo C<@ARGV>, leerá la entrada desde C<STDIN>; ver L<perlop/"Operadores E/S">.

source: perl51311delta Perl changes in version 5.13.11
es_es: perl51311delta Cambios en la versión 5.13.11

# seek($fh, 0, SEEK_END) or die "Cannot seek - $! ";
source: seek($fh, 0, SEEK_END) or die "Cannot seek - $!\n";
es_es: seek($fh, 0, SEEK_END) or die "No puedo posicionarme - $!\n";

source: The F<Cross> directory contains various files related to cross-compiling Perl.
es_es: El directorio F<Cross> contiene varios archivos relacionados con la compilación multiplataforma de Perl.

source: If you enable warnings, you'll be notified of an uninitialized value whenever you treat C<undef> as a string or a number.
es_es: Si ha activado los avisos (warnings), será notificado de un valor no inicializado cada vez que trate a C<undef> como si fuera una cadena o número.

source: This document describes differences between the 5.12.2 release and the 5.12.3 release.
es_es: Este documento describe las diferencias entre la versión 5.12.2 y la versión 5.12.3.

source: When doing so the following rules apply:
es_es: Al hacerlo se aplicarán las siguientes reglas:

source: In this case you can do:
es_es: En este caso puede hacer:

source: perl program 2>diag.out
es_es: perl programa 2>diag.out

source: So we have
es_es: Por lo que tenemos

source: =head2 Definitions
es_es: =head2 Definiciones

source: x A null byte (a.k.a ASCII NUL, "\000", chr(0))
es_es: x Un byte nulo (es decir, ASCII NUL, "\000", chr(0))

source: # foo eq "\xe2\x92\xb6\xe2\x92\xb7\xe2\x92\xb8\xe2\x92\xb9"
es_es: # foo es "\xe2\x92\xb6\xe2\x92\xb7\xe2\x92\xb8\xe2\x92\xb9"

source: For the tangent operation, you may use the C<Math::Trig::tan> function, or use the familiar relation:
es_es: Para la operación tangente, puede usar la función C<Math::Trig::tan>, o usar la conocidad relación:

source: Perl combines (in the author's opinion, anyway) some of the best features of C, B<sed>, B<awk>, and B<sh>, so people familiar with those languages should have little difficulty with it.
es_es: Perl combina (en opinión del autor) algunas de las mejores características de C, B<sed>, B<awk> y B<sh>, por lo que las personas familiarizadas con estos lenguajes aprenderán Perl fácilmente

source: with EXPR %ENV environment
es_es: con EXPR %ENV entorno

source: $ARGV[1] =~ tr/A-Z/a-z/; # canonicalize to lower case ASCII
es_es: $ARGV[1] =~ tr/A-Z/a-z/; # transforma a minúsculas ASCII

source: perlpacktut Perl pack() and unpack() tutorial
es_es: perlpacktut Tutorial de pack() y unpack()

source: Many operators can be overloaded for objects.
es_es: Muchos operadores pueden ser sobrecargados por objetos.

source: mkdir 'tmp', 0777 or die "can't mkdir $tmpdir/tmp: $!";
es_es: mkdir 'tmp', 0777 or die "no puedo hacer mkdir $tmpdir/tmp: $!";

source: =head1 Flavors of Perl numeric operations
es_es: =head1 Tipos de operaciones numéricas en Perl

source: Or, if you're lazy, just:
es_es: Si no le sobra energía, puede limitarse a escribir esto:

source: Perl informally reserves lowercase module names for "pragma" modules like C<integer> and C<strict>.
es_es: Perl, de forma informal, reserva nombres de módulos en minúscula para módulos "pragma" como C<integer> y C<strict>.

source: c Complement the SEARCHLIST.
es_es: c Complementa la LISTA_BÚSQUEDA.

source: ISBN 1-56592-243-3 [2nd edition August 2003]
es_es: ISBN 1-56592-243-3 [2ª edición - Agosto de 2003]

source: A few very small changes were made to the build process on VOS to better support the platform.
es_es: Algunos cambios muy pequeños se hicieron para el proceso de la construcción en VOS para mejorar el soporte en esta plataforma.

source: When different groups within the same pattern have the same name, any reference to that name assumes the leftmost defined group.
es_es: Cuando diferentes grupos dentro del mismo patrón tienen el mismo nombre, cualquier referencia a ese nombre se supone que es al grupo definido que esté más a la izquierda.

source: =item each HASH X<each> X<hash, iterator>
es_es: =item each HASH X<each> X<hash, iterator> X<hash, iterador>

source: Supplying a C<*> for the repeat count instead of a number means to use however many items are left, except for:
es_es: El suministro de un C<*> para el número de repeticiones en lugar de un número significa usar tantos elementos como queden, a excepción de:

source: If you're trying to develop an @AoA array containing all these, here's the right way to do that:
es_es: Si está tratando de desarrollar un array @AoA conteniendo todo eso, esta es la manera correcta de hacerlo:

source: (NOTE: If FILEHANDLE is a variable and the next token is a term, it may be misinterpreted as an operator unless you interpose a C<+> or put parentheses around the arguments.) If FILEHANDLE is omitted, prints to the last selected (see L</select>) output handle.
es_es: (NOTA: Si IDENTIFICADOR_ARCHIVO es una variable y el siguiente símbolo es un término, puede ser mal interpretado como un operador a menos que se interponga un C<+> o poner entre paréntesis los argumentos.) Si IDENTIFICADOR_ARCHIVO se omite, se imprime al canal de salida seleccionado por última vez (vea L</select>).

source: perlbs2000 Perl notes for POSIX-BC BS2000
es_es: perlbs2000 Notas para POSIX-BC BS2000

source: A pair of parentheses following it does not (necessarily) delimit its argument.
es_es: Un par de paréntesis puestos a continuación no (necesariamente) delimitan su argumento.

source: =head1 BUILDING PERL ON UTS
es_es: =head1 CONSTRUYENDO PERL EN UTS

source: (The filehandles C<stdin>, C<stdout>, and C<stderr> will also work except in packages, where they would be interpreted as local identifiers rather than global.) Additional filehandles may be created with the open() function, amongst others.
es_es: (Los identificadores de archivo C<stdin>, C<stdout>, y C<stderr> también funcionarán, excepto en paquetes en el que podrían ser interpretados como identificadores locales en lugar de globales). Identificadores de archivo adicionales pueden ser creados con la función open(), entre otros.
